<!DOCTYPE html>
<html lang="ja">
    <head>
        <meta charset="utf-8">
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
        <title>漢字探し</title>
        
        <style>
            
        
            body {
                background-color:rgb(181,241,153);
            }
            a{
                display:inline-block;
                text-align:center;
                font-size:2em;
                margin:0px;
                text-decoration : none;
                color:inherit;
            }
            p{
                display:inline-block;
                text-align:center;
                font-size:2em;
                margin:0px;
            }
        </style>
    </head>
    <body>
        <h1>蛸を探してください</h1>
        
        
        
    
        <?php 
        $insects = ['蛸','蜒','蛾','蜎','蜈','蜍','蜀','蛻',
        '蜓','蜂','蜊','蜂','蜑','蜹','蜊','蜒','蛾','蜎','蜈','蜍','蜀','蛻',
        '蜓','蜂','蜊','蜂','蜑','蜹','蜊','蜒','蛾','蜎','蜈','蜍','蜀','蛻',
        '蜓','蜂','蜊','蜂','蜑','蜹','蜊','蜒','蛾','蜎','蜈','蜍','蜀','蛻',
        '蜓','蜂','蜊','蜂','蜑','蜹','蜊','蜒','蛾','蜎','蜈','蜍','蜀','蛻',
        '蜓','蜂','蜊','蜂','蜑','蜹','蜊','蜒','蛾','蜎','蜈','蜍','蜀','蛻',
        '蜓','蜂','蜊','蜂','蜑','蜹','蜊','蜒','蛾','蜎','蜈','蜍','蜀','蛻',
        '蜓','蜂','蜊','蜂','蜑','蜹','蜊','蜒','蛾','蜎','蜈','蜍','蜀','蛻',
        '蜓','蜂','蜊','蜂','蜑','蜹','蜊','蜒','蛾','蜎','蜈','蜍','蜀','蛻',
        '蜓','蜂','蜊','蜂','蜑','蜹','蜊','蜒','蛾','蜎','蜈','蜍','蜀','蛻',
        '蜓','蜂','蜊','蜂','蜑','蜹','蜊','蜒','蛾','蜎','蜈','蜍','蜀','蛻',
        '蜓','蜂','蜊','蜂','蜑','蜹','蜊','蜒','蛾','蜎','蜈','蜍','蜀','蛻',
        '蜓','蜂','蜊','蜂','蜑','蜹','蜊','蜒','蛾','蜎','蜈','蜍','蜀','蛻',
        '蜓','蜂','蜊','蜂','蜑','蜹','蜊','蜒','蛾','蜎','蜈','蜍','蜀','蛻',
        '蜓','蜂','蜊','蜂','蜑','蜹','蜊','蜒','蛾','蜎','蜈','蜍','蜀','蛻',
        '蜓','蜂','蜊','蜂','蜑','蜹','蜊','蜒','蛾','蜎','蜈','蜍','蜀','蛻',
        '蜓','蜂','蜊','蜂','蜑','蜹','蜊','蜒','蛾','蜎','蜈','蜍','蜀','蛻',
        '蜓','蜂','蜊','蜂','蜑','蜹','蜊','蜒','蛾','蜎','蜈','蜍','蜀','蛻',
        '蜓','蜂','蜊','蜂','蜑','蜹','蜊','蜒','蛾','蜎','蜈','蜍','蜀','蛻',
        '蜓','蜂','蜊','蜂','蜑','蜹','蜊','蜒','蛾','蜎','蜈','蜍','蜀','蛻',
        '蜓','蜂','蜊','蜂','蜑','蜹','蜊','蜒','蛾','蜎','蜈','蜍','蜀','蛻',
        '蜓','蜂','蜊','蜂','蜑','蜹','蜊','蜒','蛾','蜎','蜈','蜍','蜀','蛻',
        '蜓','蜂','蜊','蜂','蜑','蜹','蜊'];
        
    
       $i = 0;
       $ransu = rand(0,309);

       while ($i < 309) {
        if($i % 30 ===0){
           if($ransu === 0) {
                print('<a href="corect.php">'.$insects[$ransu].'</a>' . "\n");
                $i = $i + 1;
                $ransu += 1;
                if($ransu === 309){
                    $ransu = 0;
                }
           }else{
           print('<p>'.$insects[$ransu].'</p>'."\n");
           $i = $i + 1;
           $ransu += 1;
           if($ransu === 309){
               $ransu = 0;
           }
        }
    }else{
        if($ransu === 0) {
            print('<a href="corect.php">'.$insects[$ransu].'</a>');
            $i = $i + 1;
            $ransu += 1;
            if($ransu === 309){
                $ransu = 0;
            }
       }else{
       print('<p>'.$insects[$ransu].'</p>');
       $i = $i + 1;
       $ransu += 1;
       if($ransu === 309){
           $ransu = 0;
       }
    }
    }
       }

        ?>
            
          
            
        
    </body>
</html>